In [3]:
!pip install pandas
!pip install --upgrade pandas

Requirement already satisfied: pandas in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: pandas in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\realme\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [8]:
import pandas as pd
import numpy as np
print(pd.__version__)

2.3.3

In [9]:
l1=np.array([10,20,30,40,50])
l2=[10,20,30,40]
d1= {'A':20, 'B':100, 'C':10}

In [17]:
#panda series
pds= pd.Series(l1, index=['A', 'B', 'C','D','E'], dtype='f8')#float 64bits
pds1= pd.Series(l1, dtype='f8')
pds1

0    10.0
1    20.0
2    30.0
3    40.0
4    50.0
dtype: float64

In [16]:
pds

A    10.0
B    20.0
C    30.0
D    40.0
E    50.0
dtype: float64

In [20]:
#panda series out of dictionary
pds2=pd.Series(d1)
pds2

A     20
B    100
C     10
dtype: int64

In [21]:
pds2['A']

np.int64(20)

In [25]:
#data frame 
marks={
    'Phy':[33,45,3,24],
    'Chem':[35,34,21,45],
    'Maths':[67,76,54,54,95],
}

df=pd.DataFrame(marks)
df

ValueError: All arrays must be of the same length

In [27]:
#to remove this error to match lengths use -> none, null so that it can match the length of each column/series

In [28]:
#data frame 
marks={
    'Phy':[33,45,3,24],
    'Chem':[35,34,21,45],
    'Maths':[67,76,54,54],
}

df=pd.DataFrame(marks)
df

   Phy  Chem  Maths
0   33    35     67
1   45    34     76
2    3    21     54
3   24    45     54

In [31]:
df=pd.DataFrame(marks, index=['A', 'B','C','D'])
df

   Phy  Chem  Maths
A   33    35     67
B   45    34     76
C    3    21     54
D   24    45     54

In [42]:
df=pd.DataFrame(marks, index=['A', 'B','C','D'], columns=['Phy','Mathematics'])
df

   Phy Mathematics
A   33         NaN
B   45         NaN
C    3         NaN
D   24         NaN

In [53]:
df=pd.DataFrame(marks, index=['A', 'B','C','D'])

In [33]:
df['Phy']

A    33
B    45
C     3
D    24
Name: Phy, dtype: int64

In [34]:
df.Phy

A    33
B    45
C     3
D    24
Name: Phy, dtype: int64

In [37]:
na=np.random.randint(50,101,size=(10,3))
na

array([[82, 76, 94],
       [63, 82, 53],
       [91, 93, 72],
       [91, 83, 76],
       [53, 74, 79],
       [68, 95, 65],
       [90, 99, 93],
       [97, 68, 71],
       [68, 91, 78],
       [66, 53, 98]], dtype=int32)

In [45]:
df2=pd.DataFrame(na, columns=['OS', 'DBMS', 'CN'],dtype='f8')
df2

     OS  DBMS    CN
0  82.0  76.0  94.0
1  63.0  82.0  53.0
2  91.0  93.0  72.0
3  91.0  83.0  76.0
4  53.0  74.0  79.0
5  68.0  95.0  65.0
6  90.0  99.0  93.0
7  97.0  68.0  71.0
8  68.0  91.0  78.0
9  66.0  53.0  98.0

In [47]:
df2['CA']=np.random.randint(50,101,size=(10,)) #adding new column
df2

     OS  DBMS    CN  CA
0  82.0  76.0  94.0  83
1  63.0  82.0  53.0  53
2  91.0  93.0  72.0  81
3  91.0  83.0  76.0  84
4  53.0  74.0  79.0  52
5  68.0  95.0  65.0  66
6  90.0  99.0  93.0  68
7  97.0  68.0  71.0  73
8  68.0  91.0  78.0  79
9  66.0  53.0  98.0  96

In [48]:
df2.info()#non-null values count and its type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   OS      10 non-null     float64
 1   DBMS    10 non-null     float64
 2   CN      10 non-null     float64
 3   CA      10 non-null     int32
dtypes: float64(3), int32(1)
memory usage: 412.0 bytes

In [50]:
#numpy array of data frames (only numerical values)
df2.values

array([[82., 76., 94., 83.],
       [63., 82., 53., 53.],
       [91., 93., 72., 81.],
       [91., 83., 76., 84.],
       [53., 74., 79., 52.],
       [68., 95., 65., 66.],
       [90., 99., 93., 68.],
       [97., 68., 71., 73.],
       [68., 91., 78., 79.],
       [66., 53., 98., 96.]])

In [52]:
#fetching only attributes/column names
df2.columns

Index(['OS', 'DBMS', 'CN', 'CA'], dtype='object')

In [54]:
df.columns

Index(['Phy', 'Chem', 'Maths'], dtype='object')

In [59]:
# rename columns
df.rename(columns={'Phy':'P', 'Chem':'C', 'Maths':'M'})
df.columns
#or
df.columns=['P','C','M']
df.columns

Index(['P', 'C', 'M'], dtype='object')

In [65]:
#coverting df to csv
df.to_csv('Marks.csv')
#marks.csv (with comma separator)
#,P,C,M
# A,33,35,67
# B,45,34,76
# C,3,21,54
# D,24,45,54
df.to_csv('Marks.csv', sep='|') #each entry separated with "\" this

In [68]:
#converting df to multiple extensions/file types
#df.to_(sql, html, csv, clipboard......)

In [70]:
ndf= pd.read_csv('Marks.csv', sep='|')
ndf

  Unnamed: 0   P   C   M
0          A  33  35  67
1          B  45  34  76
2          C   3  21  54
3          D  24  45  54

In [92]:
ndf= pd.read_csv('Marks.csv', sep='|', index_col='Unnamed: 0')
#index_col means very first column (index column)
#index should be unique
#ndf= pd.read_csv('Marks.csv', sep='|', index='false')
ndf

TypeError: read_csv() got an unexpected keyword argument 'index'

In [89]:
#for text format
pop_df=pd.read_csv('populations.txt', sep='\t')
pop_df

    # year     hare     lynx  carrot
0     1900  30000.0   4000.0   48300
1     1901  47200.0   6100.0   48200
2     1902  70200.0   9800.0   41500
3     1903  77400.0  35200.0   38200
4     1904  36300.0  59400.0   40600
5     1905  20600.0  41700.0   39800
6     1906  18100.0  19000.0   38600
7     1907  21400.0  13000.0   42300
8     1908  22000.0   8300.0   44500
9     1909  25400.0   9100.0   42100
10    1910  27100.0   7400.0   46000
11    1911  40300.0   8000.0   46800
12    1912  57000.0  12300.0   43800
13    1913  76600.0  19500.0   40900
14    1914  52300.0  45700.0   39400
15    1915  19500.0  51100.0   39000
16    1916  11200.0  29700.0   36700
17    1917   7600.0  15800.0   41800
18    1918  14600.0   9700.0   43300
19    1919  16200.0  10100.0   41300
20    1920  24700.0   8600.0   47300

In [90]:
#removing index
pop_df=pd.read_csv('populations.txt', sep='\t')

In [93]:
#df.astype('i8')
#dropping a particular column
df

    P   C   M
A  33  35  67
B  45  34  76
C   3  21  54
D  24  45  54

In [94]:
df.drop(columns='C')

    P   M
A  33  67
B  45  76
C   3  54
D  24  54

In [100]:
df

    P   M
A  33  67
B  45  76
C   3  54
D  24  54

In [102]:
df.drop(columns=['P'],inplace=True)
df

    M
A  67
B  76
C  54
D  54

In [103]:
df2

     OS  DBMS    CN  CA
0  82.0  76.0  94.0  83
1  63.0  82.0  53.0  53
2  91.0  93.0  72.0  81
3  91.0  83.0  76.0  84
4  53.0  74.0  79.0  52
5  68.0  95.0  65.0  66
6  90.0  99.0  93.0  68
7  97.0  68.0  71.0  73
8  68.0  91.0  78.0  79
9  66.0  53.0  98.0  96

In [104]:
df2.describe() #statistical information of each column (25% -> percentile)

              OS      DBMS         CN         CA
count  10.000000  10.00000  10.000000  10.000000
mean   76.900000  81.40000  77.900000  73.500000
std    15.058774  14.12012  14.003571  13.994046
min    53.000000  53.00000  53.000000  52.000000
25%    66.500000  74.50000  71.250000  66.500000
50%    75.000000  82.50000  77.000000  76.000000
75%    90.750000  92.50000  89.500000  82.500000
max    97.000000  99.00000  98.000000  96.000000

In [106]:
df2[['CA','DBMS']]

   CA  DBMS
0  83  76.0
1  53  82.0
2  81  93.0
3  84  83.0
4  52  74.0
5  66  95.0
6  68  99.0
7  73  68.0
8  79  91.0
9  96  53.0

In [108]:
df2['CA']

0    83
1    53
2    81
3    84
4    52
5    66
6    68
7    73
8    79
9    96
Name: CA, dtype: int32

In [110]:
#iloc -> accesing a particular value ->index location
df2.iloc[2,3]

np.int32(81)

In [112]:
df2.iloc[2] #row indexed 2 fetched

OS      91.0
DBMS    93.0
CN      72.0
CA      81.0
Name: 2, dtype: float64

In [113]:
df2.iloc[:,1] #kind of numpy slicing

0    76.0
1    82.0
2    93.0
3    83.0
4    74.0
5    95.0
6    99.0
7    68.0
8    91.0
9    53.0
Name: DBMS, dtype: float64

In [117]:
#fancy indexing
df2.iloc[:,[1,2]]

   DBMS    CN
0  76.0  94.0
1  82.0  53.0
2  93.0  72.0
3  83.0  76.0
4  74.0  79.0
5  95.0  65.0
6  99.0  93.0
7  68.0  71.0
8  91.0  78.0
9  53.0  98.0

In [118]:
df2.iloc[[1,2,3,4,5],:]

     OS  DBMS    CN  CA
1  63.0  82.0  53.0  53
2  91.0  93.0  72.0  81
3  91.0  83.0  76.0  84
4  53.0  74.0  79.0  52
5  68.0  95.0  65.0  66

In [119]:
#loc -> locations
df

    M
A  67
B  76
C  54
D  54

In [121]:
marks={
    'Phy':[33,45,3,24],
    'Chem':[35,34,21,45],
    'Maths':[67,76,54,95],
}

df=pd.DataFrame(marks)
df

   Phy  Chem  Maths
0   33    35     67
1   45    34     76
2    3    21     54
3   24    45     95

In [122]:
#filtering
df.iloc[[True, False, True, False]]

   Phy  Chem  Maths
0   33    35     67
2    3    21     54

In [123]:
df2['OS'] + df2['CN'] #same as vectorization in numpy

0    176.0
1    116.0
2    163.0
3    167.0
4    132.0
5    133.0
6    183.0
7    168.0
8    146.0
9    164.0
dtype: float64

In [125]:
df2['OS']/100

0    0.82
1    0.63
2    0.91
3    0.91
4    0.53
5    0.68
6    0.90
7    0.97
8    0.68
9    0.66
Name: OS, dtype: float64

In [130]:
#find the total marks of each student (add column wise means for a row add up all values of column) and store it in a new column
df2['total']=df2['OS']+df2['CN'] + df2['DBMS'] +df2['CA'] 
df2

     OS  DBMS    CN  CA  total
0  82.0  76.0  94.0  83  335.0
1  63.0  82.0  53.0  53  251.0
2  91.0  93.0  72.0  81  337.0
3  91.0  83.0  76.0  84  334.0
4  53.0  74.0  79.0  52  258.0
5  68.0  95.0  65.0  66  294.0
6  90.0  99.0  93.0  68  350.0
7  97.0  68.0  71.0  73  309.0
8  68.0  91.0  78.0  79  316.0
9  66.0  53.0  98.0  96  313.0

In [131]:
#best way to filter
df2[df2['OS']>=80]

     OS  DBMS    CN  CA  total
0  82.0  76.0  94.0  83  335.0
2  91.0  93.0  72.0  81  337.0
3  91.0  83.0  76.0  84  334.0
6  90.0  99.0  93.0  68  350.0
7  97.0  68.0  71.0  73  309.0

In [133]:
#reduction from numpy
df2.sum(axis=0)

OS        769.0
DBMS      814.0
CN        779.0
CA        735.0
total    3097.0
dtype: float64

In [135]:
df2.sum(axis=1)

0    670.0
1    502.0
2    674.0
3    668.0
4    516.0
5    588.0
6    700.0
7    618.0
8    632.0
9    626.0
dtype: float64

In [137]:
#I just want sum of OS and DBMS 
df2[['OS','DBMS']].sum(axis=1)
#you can apply other numpy reduction methods as well

0    158.0
1    145.0
2    184.0
3    174.0
4    127.0
5    163.0
6    189.0
7    165.0
8    159.0
9    119.0
dtype: float64